{
  "whatsnew": [
    {"BuildDate": "5/1/2018", "BuildVersion": "2.18.0501", "BuildChanges": "Initial rebuilding in Angular 7"},
    {"BuildDate": "6/22/2021", "BuildVersion": "2.21.0622", "BuildChanges": "Updated functionality to correct the access to some databases where using altname instead of id name. Also enabled the saved queries and stored proc viewer. Added a error message within the filter section to display when an illegal character has been typed."},
    {"BuildDate": "6/23/2021", "BuildVersion": "2.21.0623", "BuildChanges": "Correction to filter error that would not switch the applied filter when a new tab is selected."},
    {"BuildDate": "6/30/2021", "BuildVersion": "2.21.0630", "BuildChanges": "Added previously hidden function and added new function like the user manager. Also included the last login information which is displayed in the banner. Add the ability to select a distinct column when selecting a limited column display. Corrected other bugs identified by SMEs. User Manager only available to a select number of users."},
    {"BuildDate": "7/13/2021", "BuildVersion": "2.21.0713", "BuildChanges": "Unable to open previously saved queries. Would not display an error, just no response on click. -Applied filters would not produce any results. This was corrected in the user log as single quotes was causing an error. -When a saved query is clicked, the raw sql statement was displayed instead of a santized sentence version. That was corrected."},
    {"BuildDate": "7/15/2021", "BuildVersion": "2.21.0715", "BuildChanges": "Corrected bug when attempting to open a freshly saved query, it would through an error because the list was not available in the user's personal stored list."},
    {"BuildDate": "8/17/2021", "BuildVersion": "2.21.0817", "BuildChanges": "Modified start up file to display errors in case there is an error return from connecting to the database. Also, added more server options (dev, preprod) to account for the additional servers now available at CCSA."},
    {"BuildDate": "9/1/2021", "BuildVersion": "2.21.0901", "BuildChanges": "Altered the locale information and removed herndon and replaced with local. Also included the other possible servers to the list (development and preprod). These are primarily on the CCSA servers and can be ignored if moved. Also switch the default operator from LIKE to =. More people requested it over Larry. Also added the capability to store selected columns definition which will be automatically applied each time the user logs in until they clear it.  This is also true for the primary key.  For those table that do not have an existing primary key, the key is stored and will return each time they user logs on until it is cleared."},
    {"BuildDate": "9/9/2021", "BuildVersion": "2.21.0909", "BuildChanges": "Added a console logging system within the app so it is available on the production servers which doesn't have development tools available."},
    {"BuildDate": "9/22/2021", "BuildVersion": "2.21.0922", "BuildChanges": "Corrected the error with the What's New window."},
    {"BuildDate": "10/7/2021", "BuildVersion": "2.21.1007", "BuildChanges": "Switched Server selection back to read only.  Modified the INDEX.HTML file to eliminate the need to uncomment based on the current server selection. Modified the WhatsNew to display if the db version if greater than the user version."},
    {"BuildDate": "10/21/2021", "BuildVersion": "2.21.1021", "BuildChanges": "Corrected bug in the filter condition variable where it would not include 'AND' or 'OR' between multiple values, especially if IS NULL or IS NOT NULL is used.  - Also enabled the update button when only the condition is altered and applied.  - Added additional logs to the ConLog service to return on main development window.  - Updated the query build function to be cleaner and eliminate potential duplicates or errors. Also deleted a large bulk of commented out code  - Remained the constructJoinSentence2 function back to constructJoinSentence.  - Deleted dead code from index.html."},
    {"BuildDate": "11/1/2021", "BuildVersion": "2.21.1101", "BuildChanges": "Added page classification tag at top of banner that will remain through operation and remove the server list and replaced with network identification."},
    {"BuildDate": "11/4/2021", "BuildVersion": "2.21.1104", "BuildChanges": "Aggregated network and server fields and to remain readonly. - Modified the need to determine server, will use the currently selected server for all actions. Removed the selection options in serverconfig.xml and config.xml file - Modified the web.config to display only the DB name in the connectionstring ID - Fix bug in accidental changes when using the updater. - Cleaned out confirmed dead code. - Incorporated capability to work on SIPR using exactly the same app compiled code and API. Needs to be tested on SIPR. - Added NETWORK attribute the config.xml to help the system identify its parent network."},
    {"BuildDate": "2/2/2022", "BuildVersion": "2.22.0202 (1.6)", "BuildChanges": "Rewrote the Distinct functionality to include updating the API so the distinct column name is moved to the front of the string.  Confirmed that information is properly saved in the database when the user returns and selects the same table  - Fixed distinct bug in the columns dialog window so when initially selected it will reorder the selected column list based on the selected, if any, distinct column.  - Corrected bug in What's New function ignore if build information is null and don't attempt to display dialog  - Changes the display casing of the columns in the display window version the casing for SQL.  - Added title text to version button as well as included CCSA managed versioning.  - Added Trident to the search parameters when testing for the browser type.  Not capturing all browser types.  - Modified the code to display the loading indicator in the results section when loading information.  - Corrected bug in filter section to include the table name in the where clause. Eliminates ambiguious columns.  - Improved the operations of the join section to include updating how the information is displayed in the both SQL and Sentence display modes.  - Created new Display Mode function, which is available in the User Options panel to display the sql statement in either SQL or Sentence formats. "},
    {"BuildDate": "5/25/2022", "BuildVersion": "2.22.0421", "BuildChanges": "Corrected error in primary key selection tool to save the key information and allow the user to remove or change the selected primary key without the need to reloaded the table. - Corrected bug on User Manager section to change the default database for any user.  - Added the function to reset active Portal sessions from the tool. - Added the capability to change the format of the SQL query string, either display in SQL format or in sentence format. Selectable for individual user. - Disabled the clipboard capability, it isn't working as predicted, so it will be added to the TODO list."},
    {"BuildDate": "11/17/2021", "BuildVersion": "2.21.1117", "BuildChanges": "Corrected save query bug when filters are included. Added notification if user attempt to access the application from Internet Explorer which is not supported. Provided notification if the user clicks the back or refresh button. Disabled the clipboard button until fully developed. Fixed the user option bug that would not allow for saving of changes. Added loading indicator to the results section of the window. Adjusted the width of the displayed query to not extend beyond the right side."},
    {"BuildDate": "11/24/2021", "BuildVersion": "2.21.1124", "BuildChanges": "Updated Angular version from 7.1 to 10.2. Polished JOIN functionality and confirmed it is working as expected."},
    {"BuildDate": "6/22/2021", "BuildVersion": "2.21.0622", "BuildChanges": "Updated functionality to correct the access to some databases where using altname instead of id name. Also enabled the saved queries and stored proc viewer. Added a error message within the filter section to display when an illegal character has been typed."},
    {"BuildDate": "6/23/2021", "BuildVersion": "2.21.0623", "BuildChanges": "Correction to filter error that would not switch the applied filter when a new tab is selected."},
    {"BuildDate": "6/30/2021", "BuildVersion": "2.21.0630", "BuildChanges": "Corrected Primary Key function and added Viewer window and user manager capabilities. Also included the last login information which is displayed in the banner. Add the ability to select a distinct column when selecting a limited column display. Corrected other bugs identified by SMEs. User Manager only available to a select number of users."},
    {"BuildDate": "7/13/2021", "BuildVersion": "2.21.0713", "BuildChanges": "Corrections to multiple bugs. -Unable to open previously saved queries. Would not display an error, just no response on click. -Applied filters would not produce any results. This was corrected in the user log as single quotes was causing an error. -When a saved query is clicked, the raw sql statement was displayed instead of a santized sentence version. That was corrected."},
    {"BuildDate": "7/15/2021", "BuildVersion": "2.21.0715", "BuildChanges": "Corrected bug when attempting to open a freshly saved query, it would through an error because the list was not available in the user's personal stored list."},
    {"BuildDate": "8/17/2021", "BuildVersion": "2.21.0817", "BuildChanges": "Modified start up file to display errors in case there is an error return from connecting to the database. Also, added more server options (dev, preprod) to account for the additional servers now available at CCSA."},
    {"BuildDate": "9/1/2021", "BuildVersion": "2.21.0901", "BuildChanges": "Altered the locale information and removed herndon and replaced with local. Also included the other possible servers to the list (development and preprod). These are primarily on the CCSA servers and can be ignored if moved. Also switch the default operator from LIKE to =. More people requested it over Larry. Also added the capability to store selected columns definition which will be automatically applied each time the user logs in until they clear it.  This is also true for the primary key.  For those table that do not have an existing primary key, the key is stored and will return each time they user logs on until it is cleared."},
    {"BuildDate": "9/9/2021", "BuildVersion": "2.21.0909", "BuildChanges": "Added a console logging system within the app so it is available on the production servers which doesn't have development tools available."},
    {"BuildDate": "9/22/2021", "BuildVersion": "2.21.0922", "BuildChanges": "Corrected the error with the What's New window. New functionality to now display for all users when a change occurs within the application.  Either a new or corrected function added to the project."},
    {"BuildDate": "10/7/2021", "BuildVersion": "2.21.1007", "BuildChanges": "Switched Server selection back to read only.  Modified the INDEX.HTML file to eliminate the need to uncomment based on the current server selection. Modified the WhatsNew to display if the db version if greater than the user version."},
    {"BuildDate": "10/21/2021", "BuildVersion": "2.21.1021", "BuildChanges": "Corrected bug in the filter condition variable where it would not include 'AND' or 'OR' between multiple values, especially if IS NULL or IS NOT NULL is used. - Also enabled the update button when only the condition is altered and applied. - Added additional logs to the ConLog service to return on main development window. - Updated the query build function to be cleaner and eliminate potential duplicates or errors. Also deleted a large bulk of commented out code - Remained the constructJoinSentence2 function back to constructJoinSentence. - Deleted dead code from index.html."},
    {"BuildDate": "11/1/2021", "BuildVersion": "2.21.1101", "BuildChanges": "Added page classification tag at top of banner that will remain through operation and remove the server list and replaced with network identification."},
    {"BuildDate": "5/25/2022", "BuildVersion": "2.22.0421", "BuildChanges": "Corrected error in primary key selection tool to save the key information and allow the user to remove or change the selected primary key without the need to reloaded the table. - Corrected bug on User Manager section to change the default database for any user.  - Added the function to reset active Portal sessions from the tool. - Added the capability to change the format of the SQL query string, either display in SQL format or in sentence format. Selectable for individual user. - Disabled the clipboard capability, it isn't working as predicted, so it will be added to the TODO list."},
    {"BuildDate": "6/28/2022", "BuildVersion": "2.22.0628", "BuildChanges": "Updated Angular version from 10.2 to 14.0."},
    {"BuildDate": "9/7/2022", "BuildVersion": "2.22.0907", "BuildChanges": "Upgraded Angular Version from 14.0 to 14.2."},
    {"BuildDate": "9/12/2022", "BuildVersion": "2.22.0912", "BuildChanges": "Upgraded all grids from datatables to ag-grid to address security concerns identified by Fortify."},
    {"BuildDate": "12/30/2022", "BuildVersion": "2.22.1230", "BuildChanges": "Added more data types options to the switch statement for the filter, especially for the string, to eliminate the blank following the condition statement (=). -Updated the Return to Orders button to only work when running in production environment. -Examined primary key selection function to allow the user to select more than one column as an aggregated primary key. Function appears to be working at this point. -Removal of unused or unneeded variable definitions throughout."},
    {"BuildDate": "1/3/2023", "BuildVersion": "2.23.0103", "BuildChanges": "Fixed a div layout issue on filter page. - Corrected the verbiage of the sql sentence format. It was displaying incorrectly. - Updated Title Image Text. -Corrected formatting of bullets in What's New Page."},
    {"BuildDate": "1/4/2023", "BuildVersion": "2.23.0104", "BuildChanges": "Switched the What's New content from database driven to locally driven from a JSON file."},
    {"BuildDate": "1/5/2023", "BuildVersion": "2.23.0105", "BuildChanges": "Corrected bug in the filter section to enable Apply button when either checkbox options are selected or deselected.\n- Protected the filter from accidentally executing a filter without a table being selected first.\n- Corrected bug in the excel/csv export functionality."},
    {"BuildDate": "2/13/2023", "BuildVersion": "2.23.0213", "BuildChanges": "Switched API from using any Gets to all being Posts to improve security as it was identified that 'Man In The Middle' hacks can capture the returned information allowing users to query the API without the benefits of the application. - Added a DEVKEY for a request token request used only during the development of the application. - Now added a secure key function that uses a unique key for the individual which is only available for an hour unless a authorized request is posted again it. The key is validated each time a request is sent to the API and the key is only stored in the app and database. - Updated the data service and removed the explicit url information, switching to a relative based on the server.  Had to include additional subdirectory information which is usually only available on hosted servers. - To allow the system to work using POST in a development environment, I had to include a proxy for development only so we can avoid CORS messages from the API.- Made a correction in the servers component to have a default of {0} if there is no offName provided. - Updated the config.xml file and removed the need for the URL path, as indicated above with the change to POST.-Fix bug in setting the IsAdmin for the user. \n- Corrected the bug that would not allow users to be deleted.\n- Fixed bug that failed to purge the QT Logs\n- Fixed bug and recreated function that will allow system to delete duplicate in the central users table.\n- Fixed bug in Portal Session reset function.\n- Fixed bug to add users to the query tool list.  This will update two tables on in MOBCOP and one in COADOS.\n- Fixed bug in database option selection.  Also improved code to allow null values to not fail application and force the user to make a selection to continue. \n- Created two check for null or blank functions\n- Fixed the query execute function to display the results.  Also updated the displayed tab name to indicate when a tab contains the results of a stored query.\n-Update data service error handler to eliminate duplicate error messages. "},
    {"BuildDate": "2/14/2023", "BuildVersion": "2.23.0214", "BuildChanges": "Updated error message handling when a sql script fails to execute.  The error message is returned to the client side to be displayed."},
    {"BuildDate": "2/16/2023", "BuildVersion": "2.23.0216", "BuildChanges": "Provided the ability to search for the column in the custom column list.\n- Provided the ability to place columns in a specific order.\n- Fixed bug in API that would allow the saving or updating of custom column information.- Corrected the bug to display the various stored procedures, views, and functions. Refactors entire function and eliminated several lines of code."},
    {"BuildDate": "2/21/2023", "BuildVersion": "2.23.0221", "BuildChanges": "Corrected functionality of the temporary primary key.  Now will store that temporary primary key for the selected table until deleted. Added a dialog to test the API, both the GET and POST requests."},
    {"BuildDate": "5/16/2023", "BuildVersion": "2.23.0516", "BuildChanges": "Corrected bug in zero results from table, to include displaying header even if no records are found. Corrected bug in filter causing error when a stored query is called."},
    {"BuildDate": "6/14/2023", "BuildVersion": "2.23.0614", "BuildChanges": "Corrected bug in the primary key selection dialog. Now able to select multiple primary keys which will remain until the user removes them."}
  ]
}
